console.log("script connected successful");

const text = {
  ru: {
    advantage_1: {
      title: "Комплекс услуг",
      description:
        "Комплексный пакет услуг наиболее удобен и быстр, требует минимального внимания со стороны заказчика. Включает все работы необходимые для начала эксплуатации автономной канализации, включая подготовительные",
    },
    advantage_2: {
      title: "Готовые решения",
      description:
        "Больше 10 лет успешного изготовления, введения в эксплуатацию и сервисного обслуживания, выработали готовые наборы оборудования для решения большинства задач. Готовые решения экономят средства и время, увеличивают ресурс службы узлов",
    },
    advantage_3: {
      title: "Автоматизация и автономность",
      description:
        "Автоматический процесс очистки справится с любым объемом стоков, не зависит от внешних условий и не нуждается в привлечении службы ассенизаторов (откачки). Не нуждается в пополнении бактериями, имеет систему самоочистки",
    },
    advantage_4: {
      title: "Компактность",
      description:
        "Позволяет получить безупречный результат очистки во время всего периода эксплуатации автономной канализации при этом сохраняя наиболее компактные размеры среди очистных систем представленных на рынке",
    },
    advantage_5: {
      title: "Гарантия 50 лет",
      description:
        "Собственное производство, более 16 лет опыта в направлении очистных сооружений, изготовление по запатентованной технологии с использованием проверенного европейского оборудования",
    },
    advantage_6: {
      title: "Производительность",
      description:
        "Технология SBR позволяет перерабатывать большие объемы стоков без гниения и запахов. Производительность сохраняется на протяжении всего периода эксплуатации очистных систем",
    },
    advantage_7: {
      title: "Установка независимо от местности и условий",
      description:
        "Возможность размещения классическим способом “В ГРУНТ” и “НА ПОВЕРХНОСТИ” как отдельно стоящее строение. Толщина пластика и особенности конструкции придают стойкости к деформациям",
    },
    advantage_8: {
      title: "Собственная сервисная служба",
      description:
        "Установка, переоборудование и обслуживание не только наших станций. Использование проверенного европейского оборудования, грамотный, опытный персонал",
    },
  },
  // uk: {
  //   advantage_1: {
  //     title: "Комплекс послуг",
  //     description:
  //       'Комплексний пакет послуг переслідує підхід "Замовив і користуйся". Найбільш зручний і швидкий, вимагає мінімальної уваги з боку замовника. Включає всі необхідні роботи для початку експлуатації автономної каналізації, включаючи підготовчі',
  //   },
  //   advantage_2: {
  //     title: "Готові рішення",
  //     description:
  //       "Більше 10 років успішного виготовлення, введення в експлуатацію та сервісного обслуговування, виробили більше 10 варіантів готових наборів обладнання для вирішення більшості типових завдань. Готове рішення спрощує процес комплектації, економлять кошти та час, збільшуючи ресурс служби вузлів, покращуючи якість кінцевого продукту",
  //   },
  //   advantage_3: {
  //     title: "Автоматизація та автономність",
  //     description:
  //       "Автоматичний процес очищення впорається з будь-яким обсягом стоків, не залежить від зовнішніх умов і не потребує залучення служби асенізаторів (відкачування). Не потребує поповнення бактеріями, має систему самоочищення",
  //   },
  //   advantage_4: {
  //     title: "Компактність",
  //     description:
  //       "Дозволяє отримати бездоганний результат очищення під час всього періоду експлуатації автономної каналізації, при цьому зберігаючи найбільш компактні розміри серед очисних систем, представлених на ринку",
  //   },
  //   advantage_5: {
  //     title: "Гарантія 50 років",
  //     description:
  //       "Власне виробництво, понад 16 років досвіду у напрямку очисних споруд, виготовлення за запатентованою технологією з використанням перевіреного європейського обладнання",
  //   },
  //   advantage_6: {
  //     title: "Продуктивність",
  //     description:
  //       "Технологія SBR дозволяє переробляти великі обсяги стоків без гниття та запахів. Продуктивність зберігається протягом усього періоду експлуатації очисних систем",
  //   },
  //   advantage_7: {
  //     title: "Встановлення незалежно від місцевості та умов",
  //     description:
  //       "Возможность размещения классическим способом “В ГРУНТ” и “НА ПОВЕРХНОСТИ” как отдельно стоящее строение. Толщина пластика и особенности конструкции придают стойкости к деформациям",
  //   },
  //   advantage_8: {
  //     title: "Власна сервісна служба",
  //     description:
  //       "Встановлення, переобладнання та обслуговування не тільки наших станцій. Використання перевіреного європейського обладнання, грамотний, досвідчений персонал",
  //   },
  // },
};

const title = document.querySelector(".info__title");
const description = document.querySelector(".info__description");
const advantageList = document.querySelectorAll(".advantage");
const info = document.querySelector(".info");

advantageList.forEach((advantage) =>
  advantage.addEventListener("mouseover", currentAdvantage)
);

// on mouseover
// --- visibility: visable;
// --- add content

advantageList.forEach((advantage) =>
  advantage.addEventListener("mouseout", isHidden)
);

// on mouseout
// --- visibility: hidden;

function currentAdvantage(event) {
  for (const languageTitle in text) {
    let currentLanguageAdvantageList = text[languageTitle];

    for (const advantageTitle in currentLanguageAdvantageList) {
      let advantage = currentLanguageAdvantageList[advantageTitle];

      if (advantageTitle === event.target.id) {
        console.log(advantage.title, advantage.description);
        title.textContent = advantage.title;
        description.textContent = advantage.description;
      }
    }
  }

  isVisable();
}

function isVisable() {
  info.classList.remove("is-hidden");
}

function isHidden() {
  info.classList.add("is-hidden");
}
